<!-- dflook/terraform-github-actions {"workspace":"default","backend":"c54035f99efa55bfad073bc204f3f5e57eb177c5844fb13ba283826d4f540a22","backend_type":"s3","plan_job_ref":"Job Terraform plan #13 at https://github.com/Thomas-mcinally/Kraken-DCA/actions/runs/7812143172","plan_hash":"24d479fc01f35dab09904485a4da5c2aae9360a4b2057806f50e39f26372b06d","plan_text_format":"text"} -->
Terraform plan in __terraform__
<details>
<summary>Plan: 1 to add, 2 to change, 1 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_lambda_function.kraken-dca-lambda will be updated in-place
  ~ resource "aws_lambda_function" "kraken-dca-lambda" {
        id                             = "kraken-dca-lambda"
      ~ layers                         = [
          - "arn:aws:lambda:eu-west-2:194627472784:layer:kraken_dca_dependencies:98",
        ] -> (known after apply)
        tags                           = {}
        # (20 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.kraken-withdraw-lambda will be updated in-place
  ~ resource "aws_lambda_function" "kraken-withdraw-lambda" {
        id                             = "kraken-withdraw-lambda"
      ~ layers                         = [
          - "arn:aws:lambda:eu-west-2:194627472784:layer:kraken_dca_dependencies:98",
        ] -> (known after apply)
        tags                           = {}
        # (20 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_layer_version.kraken_dca_dependencies must be replaced
-/+ resource "aws_lambda_layer_version" "kraken_dca_dependencies" {
      ~ arn                         = "arn:aws:lambda:eu-west-2:194627472784:layer:kraken_dca_dependencies:98" -> (known after apply)
      - compatible_architectures    = [] -> null
      - compatible_runtimes         = [] -> null
      ~ created_date                = "2024-02-07T08:15:31.494+0000" -> (known after apply)
      ~ id                          = "**********************************************************************" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:eu-west-2:194627472784:layer:kraken_dca_dependencies" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "X4uxc7ROZBcHseOB7Hub8Di+6Y9G5OO95dkP369p1fg=" -> "Q2n4tVdmTKG8ne1LaI7vebjrQXtrIk54ksotHlADDlo=" # forces replacement
      ~ source_code_size            = 12306828 -> (known after apply)
      ~ version                     = "98" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Terraform plan #13](https://github.com/Thomas-mcinally/Kraken-DCA/actions/runs/7812143172)